app/views/posts/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id %>
    <%= form.collection_select(:user_id, User.all, :id, :username)%>